const { successResponse } = require("../utils/responseHelper");

const loveMessages = [
  "คนดีชอบแก้ไข คนอย่างเราไงชอบแค่เธอ",
  "ค้อนมีไว้ทุบ แต่รักนะจุ๊บๆ มีไว้ให้เธอ",
  "กินหมูกระทะจะเจอเนื้อย่าง แต่ถ้าเธอมาอยู่ข้างๆ จะเจอเนื้อคู่",
  "รักดีๆ อาจมีที่อื่นมากมาย แต่รักเธอจนตาย มีแค่เราคนเดียว",
  "ฟุตบอลเราชอบอังกฤษ แต่ถ้าพรหมลิขิต เราชอบเธอ",
  "เหงื่อไหลเพราะหน้าร้อน ใจอ่อนเพราะน่ารัก",
  "แดดแรงมันแยงตา เธอส่งยิ้มมา มันแยงใจ",
  "ถ้ายังไม่ได้เป็นคนของใคร มาเป็นคนของใจเราได้นะ",
  "ปล่อยนกปล่อยปลาอะทำได้ แต่ปล่อยเธอไปง่ายๆ ทำไม่ได้จริงๆ",
  "เรียนหนังสืออาจจะเหนื่อย เรียนรู้กันไปเรื่อยๆ อาจจะหลงรัก",
  "ถ้าเข้าโรงหนัง ให้งดรับโทรศัพท์ ถ้าเข้าไปในใจเธอปั๊บ เรางดรับคนอื่นเลย",
  "จ้องคอมแล้วตาเบลอ แต่ถ้าจ้องเธอแล้วจะได้เบอร์ปะ",
  "ที่ยิ้มไม่ได้เจ้าชู้ เราแค่เอ็นดูในความน่ารัก",
  "แค่แมวก็ชอบร้อง แค่มองก็ชอบแล้ว",
  "ถึงยะลาเราไม่เคยไป แต่ลบเธอจากใจ เราไม่เคยทำ",
  "ถึงจะชอบหยอดมุกเสี่ยว แต่รักเธอคนเดียวนะรู้ปะ",
  "นอนน้อยอาจมีเบลอ แต่รักที่ให้เธอนั้นชัดเจน",
  "อ่านหนังสือ 10 รอบ ไม่เคยจำ เจอหน้าเธอ 1 ครั้ง เราจำไม่เคยลืม",
  "เธอชอบ A-Z ตัวไหนไม่รู้ แต่ I ชอบ U นะรู้ยัง",
  "รักซนๆ ให้ไปรักกับลิง รักจริงๆ ให้มารักกับเรา",
  "ไม่ใช่แม่นาค แต่ทำไมคิดถึงมากก็ไม่รู้",
  "ยืนคนเดียวมันเดียวดาย หากได้เธอมายืนข้างกายก็คงดี",
  "ยืมโทรศัพท์หน่อยดิ โทรศัพท์เราเสีย เสียดายที่ไม่มีเบอร์เธอ",
  'ไม่ต้องฟอลโลว์ไอจี แต่ช่วย "ฟอลอินเลิฟวิทมี" (Fall in love with me) ได้ไหม?',
  "หน้ากากอะ ต้านไวรัส แต่เธอน่ารักอะ เราต้านไม่ไหว",
  "ไม่ต้องรักเต็มร้อย แค่รักน้อยๆ แต่เต็มใจ",
  "แสงแดดอาจจะร้อน แต่ถ้าเจอเราอ้อน เธอจะรัก",
  "ตรวจเลือดไม่เจออะไร แต่ตรวจหัวใจทำไมเจอเธอ",
  "เรื่องกินไม่เคยแพ้ใคร แต่เรื่องหัวใจทำไมแพ้เธอ",
  "ใต้คางยังมีเหนียง พื้นที่ข้างเคียงยังไม่มีใคร",
];

class LoveController {
  getMessage(req, res) {
    const randomMessage =
      loveMessages[Math.floor(Math.random() * loveMessages.length)];

    return successResponse(
      res,
      {
        loveMessage: randomMessage,
      },
      "ส่งด้วยความรัก... อิอิอิอิอิ"
    );
  }
}

module.exports = new LoveController();
